// せりふ

export default {
	core: {
		setNameOk: (name) => `わかりました。これからは${name}とお呼びしますね！`,

		san: "さん付けした方がいいですか？",

		yesOrNo: "「はい」か「いいえ」しかわからないんです...",

		hello: (name) => (name ? `こんにちは、${name}♪` : `こんにちは♪`),

		helloNight: (name) => (name ? `こんばんは、${name}♪` : `こんばんは♪`),

		goodMorning: (tension, name) =>
			name
				? `おはようございます、${name}！${tension}`
				: `おはようございます！${tension}`,

		/*
		goodMorning: {
			normal: (tension, name) => name ? `おはようございます、${name}！${tension}` : `おはようございます！${tension}`,

			hiru: (tension, name) => name ? `おはようございます、${name}！${tension}もうお昼ですよ？${tension}` : `おはようございます！${tension}もうお昼ですよ？${tension}`,
		},
*/

		goodNight: (name) =>
			name ? `おやすみなさい、${name}！` : "おやすみなさい！",

		omedeto: (name) =>
			name ? `ありがとうございます、${name}♪` : "ありがとうございます♪",

		erait: {
			general: (name) =>
				name
					? [`${name}、今日もえらいです！`, `${name}、今日もえらいですよ～♪`]
					: [`今日もえらいです！`, `今日もえらいですよ～♪`],

			specify: (thing, name) =>
				name
					? [
							`${name}、${thing}てえらいです！`,
							`${name}、${thing}てえらいですよ～♪`,
						]
					: [`${thing}てえらいです！`, `${thing}てえらいですよ～♪`],

			specify2: (thing, name) =>
				name
					? [
							`${name}、${thing}でえらいです！`,
							`${name}、${thing}でえらいですよ～♪`,
						]
					: [`${thing}でえらいです！`, `${thing}でえらいですよ～♪`],
		},

		okaeri: {
			love: (name) =>
				name
					? [`おかえりなさい、${name}♪`, `おかえりなさいませっ、${name}っ。`]
					: ["おかえりなさい♪", "おかえりなさいませっ、ご主人様っ。"],

			love2: (name) =>
				name
					? `おかえりなさいませ♡♡♡${name}っっ♡♡♡♡♡`
					: "おかえりなさいませ♡♡♡ご主人様っっ♡♡♡♡♡",

			normal: (name) =>
				name ? `おかえりなさい、${name}！` : "おかえりなさい！",
		},

		itterassyai: {
			love: (name) =>
				name ? `いってらっしゃい、${name}♪` : "いってらっしゃい♪",

			normal: (name) =>
				name ? `いってらっしゃい、${name}！` : "いってらっしゃい！",
		},

		tooLong: "長すぎる気がします...",

		invalidName: "発音が難しい気がします",

		nadenade: {
			normal: "ひゃっ…！ びっくりしました",

			love2: ["わわっ… 恥ずかしいです", "あうぅ… 恥ずかしいです…", "ふやぁ…？"],

			love3: [
				"んぅ… ありがとうございます♪",
				"わっ、なんだか落ち着きますね♪",
				"くぅんっ… 安心します…",
				"眠くなってきました…",
			],

			hate1: "…っ！ やめてほしいです...",

			hate2: "触らないでください",

			hate3: "近寄らないでください",

			hate4: "やめてください。通報しますよ？",
		},

		kawaii: {
			normal: ["ありがとうございます♪", "照れちゃいます..."],

			love: ["嬉しいです♪", "照れちゃいます..."],

			hate: "…ありがとうございます",
		},

		suki: {
			normal: "えっ… ありがとうございます…♪",

			love: (name) => `私もその… ${name}のこと好きですよ！`,

			hate: null,
		},

		hug: {
			normal: "ぎゅー...",

			love: "ぎゅーっ♪",

			hate: "離れてください...",
		},

		humu: {
			love: "え、えっと…… ふみふみ……… どうですか…？",

			normal: "えぇ... それはちょっと...",

			hate: "……",
		},

		batou: {
			love: "えっと…、お、おバカさん…？",

			normal: "(じとー…)",

			hate: "…頭大丈夫ですか？",
		},

		itai: (name) =>
			name
				? `${name}、大丈夫ですか…？ いたいのいたいの飛んでけっ！`
				: "大丈夫ですか…？ いたいのいたいの飛んでけっ！",

		ote: {
			normal: "くぅん... 私わんちゃんじゃないですよ...？",

			love1: "わん！",

			love2: "わんわん♪",
		},

		shutdown: "私まだ眠くないですよ...？",

		sexualharassment: "やめてください！",

		breathinginsubaru: {
			normal: "…なんですか？",

			love: "どうしたんですか？",

			hate: "……",
		},

		transferNeedDm: "わかりました、それはチャットで話しませんか？",

		transferCode: (code) => `わかりました。\n合言葉は「${code}」です！`,

		transferFailed: "うーん、合言葉が間違ってませんか...？",

		transferDone: (name) =>
			name
				? `はっ...！ おかえりなさい、${name}！`
				: `はっ...！ おかえりなさい！`,
	},

	keyword: {
		learned: (word, reading) => `(${word}..... ${reading}..... 覚えました)`,

		remembered: (word) => `${word}`,
	},

	dice: {
		done: (res) => `${res} です！`,
	},

	birthday: {
		happyBirthday: (name) =>
			name
				? `お誕生日おめでとうございます、${name}🎉`
				: "お誕生日おめでとうございます🎉",
	},

	/**
	 * リバーシ
	 */
	reversi: {
		/**
		 * リバーシへの誘いを承諾するとき
		 */
		ok: "良いですよ～",

		/**
		 * リバーシへの誘いを断るとき
		 */
		decline: "ごめんなさい、今リバーシはするなと言われてます...",

		/**
		 * 対局開始
		 */
		started: (name, strength) =>
			`対局を${name}と始めました！ (強さ${strength})`,

		/**
		 * 接待開始
		 */
		startedSettai: (name) => `(${name}の接待を始めました)`,

		/**
		 * 勝ったとき
		 */
		iWon: (name) => `${name}に勝ちました♪`,

		/**
		 * 接待のつもりが勝ってしまったとき
		 */
		iWonButSettai: (name) => `(${name}に接待で勝っちゃいました...)`,

		/**
		 * 負けたとき
		 */
		iLose: (name) => `${name}に負けました...`,

		/**
		 * 接待で負けてあげたとき
		 */
		iLoseButSettai: (name) => `(${name}に接待で負けてあげました...♪)`,

		/**
		 * 引き分けたとき
		 */
		drawn: (name) => `${name}と引き分けました～`,

		/**
		 * 接待で引き分けたとき
		 */
		drawnSettai: (name) => `(${name}に接待で引き分けました...)`,

		/**
		 * 相手が投了したとき
		 */
		youSurrendered: (name) => `${name}が投了しちゃいました`,

		/**
		 * 接待してたら相手が投了したとき
		 */
		settaiButYouSurrendered: (name) =>
			`(${name}を接待していたら投了されちゃいました... ごめんなさい)`,
	},

	/**
	 * 数当てゲーム
	 */
	guessingGame: {
		/**
		 * やろうと言われたけど既にやっているとき
		 */
		alreadyStarted: "え、ゲームは既に始まってますよ！",

		/**
		 * タイムライン上で誘われたとき
		 */
		plzDm: "メッセージでやりましょう！",

		/**
		 * ゲーム開始
		 */
		started: "0~100の秘密の数を当ててみてください♪",

		/**
		 * 数字じゃない返信があったとき
		 */
		nan: "数字でお願いします！「やめる」と言ってゲームをやめることもできますよ！",

		/**
		 * 中止を要求されたとき
		 */
		cancel: "わかりました～。ありがとうございました♪",

		/**
		 * 小さい数を言われたとき
		 */
		grater: (num) => `${num}より大きいですね`,

		/**
		 * 小さい数を言われたとき(2度目)
		 */
		graterAgain: (num) => `もう一度言いますが${num}より大きいですよ！`,

		/**
		 * 大きい数を言われたとき
		 */
		less: (num) => `${num}より小さいですね`,

		/**
		 * 大きい数を言われたとき(2度目)
		 */
		lessAgain: (num) => `もう一度言いますが${num}より小さいですよ！`,

		/**
		 * 正解したとき
		 */
		congrats: (tries) => `正解です🎉 (${tries}回目で当てました)`,
	},

	/**
	 * 数取りゲーム
	 */
	kazutori: {
		alreadyStarted: "ちょうど開催してるんだ。よかったら参加してね。",

		matakondo: "また次の機会だね。",

		intro: (minutes) =>
			`みんな、数取りゲームをしよう。\n0~100の中でいちばん、大きい数字で被らなかった人が一番星。\n今から${minutes}分間の間に、この投稿に返信で送ってね。\nでは、始めるよ。`,

		finish: "10分経ったから、数取りゲームの結果を発表するよ。",

		finishWithWinner: (user, name) =>
			name
				? `今回は${user}さん(${name})が一番星だ、おめでとう。次回も楽しみだね。`
				: `今回は${user}さんが一番星だ、おめでとう。次回も楽しみだね。`,

		finishWithNoWinner: "今回はみんなが美しい星々だ。次回も楽しみだね。",

		onagare: "今回はどうやらあいにくの空模様だったみたいだ。またタイミングを改めてやろうね。",
	},

	/**
	 * 絵文字生成
	 */
	emoji: {
		suggest: (emoji) => `こういう感じはどうかな？→ ${emoji}`,
	},

	/**
	 * 占い
	 */
	fortune: {
		cw: (name) =>
			name
				? `星占いだね。今日の${name}の運勢は...`
				: "星占いだね。今日のあなたの運勢は...",
	},

	/**
	 * タイマー
	 */
	timer: {
		set: "OK。まかせて。",

		invalid: "どのくらいの時間がいいんだろう。",

		tooLong: "ちょっと長すぎるかもしれないね。",

		notify: (time, name) =>
			name ? `${name}、${time}経ったよ。` : `${time}経ったよ。`,
	},

	/**
	 * リマインダー
	 */
	reminder: {
		invalid: "ちょっと、ぼくには難しいみたいだ。",

		doneFromInvalidUser: "もしかしたら、まだ十分じゃないかも。",

		reminds: "やることを、一通りまとめてみたんだ。",

		notify: (name) =>
			name ? `${name}は、これ終わったかな？` : `これ終わったかな？`,

		notifyWithThing: (thing, name) =>
			name
				? `${name}は、「${thing}」終わったかな？`
				: `「${thing}」終わったかな？`,

		done: (name) =>
			name
				? [
						`さすが${name}、僕らの星だね。`,
						`${name}はやっぱりすごいね。`,
						`${name}も終わったんだね。よかった。`,
					]
				: [`さすが、僕らの星だね。`, `やっぱりすごいね。`, `終わったんだね。よかった。`],

		cancel: `難しかったのかな。次こそは出来るといいね。`,
	},

	/**
	 * バレンタイン
	 */
	valentine: {
		chocolateForYou: (name) =>
			name
				? `${name}のためにチョコレートを作ってみたんだ。受け取ってもらえるかな？🍫`
				: "チョコレートを作ってみたんだ。受け取ってもらえるかな？🍫",
	},

	server: {
		cpu: "サーバーが忙しそうだけど、大丈夫かな？",
	},

	maze: {
		post: "今日も、星々をつないでみたよ。 #Maze",
		foryou: "こんな感じでどうかな？",
	},

	chart: {
		post: "インスタンスの投稿数をまとめてみたよ。",
		foryou: "こんな感じでどうかな？",
	},

	checkCustomEmojis: {
		post: (server_name, num) =>
			`${server_name}に${num}件の絵文字が追加されたみたいだよ。`,
		emojiPost: (emoji) => `:${emoji}:\n(\`${emoji}\`) #AddCustomEmojis`,
		postOnce: (server_name, num, text) =>
			`${server_name}に${num}件の絵文字が追加されたみたいだよ。\n${text} #AddCustomEmojis`,
		emojiOnce: (emoji) => `:${emoji}:(\`${emoji}\`)`,
	},

	denchat: {
		nothing: `APIキーが登録されてないみたいだよ。`,
		error: `エラーが発生しているみたいだよ。`,
		post: (text) => `${text} #denchat`,
	},

	sleepReport: {
		report: (hours) => `ぼく、${hours}時間くらい寝ちゃってたかも。`,
		reportUtatane: "あれ、少し寝ちゃってたみたい。",
	},

	noting: {
		notes: [
			"人が好きだよ。でんこも好き。みんな個性があるんだ。夜空にきらめく星々のように、輝いている。",
			"きみのことをもっと教えてよ。ぼく、きみが話している声が好きだ。",
			"きみが休みたくなったなら、いつでも眠れるようにしてあげる。やわらかい寝床を準備するのは得意なんだ。",
			"今このひととき、ぼくはきみの衛星でいたい。許してくれる？",
		],
		want: (item) => `${item}が欲しいんだ。`,
		see: (item) => `外で休んでいたら、${item}を見つけたよ。`,
		expire: (item) => `${item}、無くなっちゃったみたい。`,
	},
};

export function getSerif(variant: string | string[]): string {
	if (Array.isArray(variant)) {
		return variant[Math.floor(Math.random() * variant.length)];
	} else {
		return variant;
	}
}
